Revit 2027 API
StructuralWallUsageFilter(StructuralWallUsage) Constructor
 Constructs a new instance of a filter to match walls that have the given structural wall usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage
)
Public Sub New (
	structuralWallUsage As StructuralWallUsage
)
public:
StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage
)
new :
        structuralWallUsage : StructuralWallUsage -> StructuralWallUsageFilter
Parameters
structuralWallUsage StructuralWallUsage
 The wall structural usage.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralWallUsageFilter Class
StructuralWallUsageFilter Overload
Autodesk.Revit.DB.Structure Namespace